Agrupación de datos

In [1]:
#importa numpy y pandas
import numpy as np
import pandas as pd

In [2]:
#dataframe a partir de un diccionario
diccionario = {'dias':['dia1','dia1','dia2','dia2','dia3'], 'vendedores':['Antonio','Maria','Jose','Marta','Juan'], 'ventas':[100,400,200,500,300]} #np.nan es un valor nulo
diccionario

{'dias': ['dia1', 'dia1', 'dia2', 'dia2', 'dia3'],
 'vendedores': ['Antonio', 'Maria', 'Jose', 'Marta', 'Juan'],
 'ventas': [100, 400, 200, 500, 300]}

In [3]:
dataframe = pd.DataFrame(diccionario)
dataframe

   dias vendedores  ventas
0  dia1    Antonio     100
1  dia1      Maria     400
2  dia2       Jose     200
3  dia2      Marta     500
4  dia3       Juan     300

In [8]:
group=dataframe.groupby('dias') #crea un objeto de tipo groupby

In [9]:
#promedio de venta en cada día 
group.mean()

      ventas
dias
dia1     250
dia2     350
dia3     300

In [10]:
group.sum() #suma de los días

      ventas
dias
dia1     500
dia2     700
dia3     300

In [11]:
group.describe() #estadisticas de datos más habituales

     ventas
      count   mean         std    min    25%    50%    75%    max
dias
dia1    2.0  250.0  212.132034  100.0  175.0  250.0  325.0  400.0
dia2    2.0  350.0  212.132034  200.0  275.0  350.0  425.0  500.0
dia3    1.0  300.0         NaN  300.0  300.0  300.0  300.0  300.0

# Combinar DataFrames

In [18]:
dic = {'A':[1,2,3],'B':[4,5,6],'c':[7,8,9]}
dic

{'A': [1, 2, 3], 'B': [4, 5, 6], 'c': [7, 8, 9]}

In [19]:
df = pd.DataFrame(dic)
df

   A  B  c
0  1  4  7
1  2  5  8
2  3  6  9

In [20]:
dic2 = {'A':[11,12,13],'B':[14,15,16],'c':[17,18,19]}

In [23]:
df2 = pd.DataFrame(dic2)
df2

    A   B   c
0  11  14  17
1  12  15  18
2  13  16  19

In [24]:
#concatenación de dos dataframes hacia abajo
pd.concat([df,df2])

    A   B   c
0   1   4   7
1   2   5   8
2   3   6   9
0  11  14  17
1  12  15  18
2  13  16  19

In [25]:
#como columnas
pd.concat([df,df2],axis=1)

   A  B  c   A   B   c
0  1  4  7  11  14  17
1  2  5  8  12  15  18
2  3  6  9  13  16  19

# Merge y dataFrames

In [30]:
dic3  = {'A':[1,2,3],'B':[4,5,6],'clave':['c1','c2','c3']}
dic3

{'A': [1, 2, 3], 'B': [4, 5, 6], 'clave': ['c1', 'c2', 'c3']}

In [32]:
df3 = pd.DataFrame(dic3)
df3

   A  B clave
0  1  4    c1
1  2  5    c2
2  3  6    c3

In [33]:
dic4  = {'C':[11,12,13],'D':[14,15,16],'clave':['c1','c2','c3']}
df4 = pd.DataFrame(dic4)
df4

    C   D clave
0  11  14    c1
1  12  15    c2
2  13  16    c3

In [40]:
#unión con la columna clave
pd.merge(df3,df4,on='clave')

   A  B clave   C   D
0  1  4    c1  11  14
1  2  5    c2  12  15
2  3  6    c3  13  16

# Pandas - Join DataFrames

In [44]:
dic5  = {'A':[1,2,3,4],'B':[4,5,6,7]}
df5 = pd.DataFrame(dic5,index=['i1','i2','i3','i4'])
df5

    A  B
i1  1  4
i2  2  5
i3  3  6
i4  4  7

In [45]:
dic6  = {'C':[11,12,13],'D':[14,15,16]}
df6 = pd.DataFrame(dic6,index=['i1','i2','i3'])
df6

     C   D
i1  11  14
i2  12  15
i3  13  16

In [46]:
#join por que coinciden los indices
df5.join(df6)

    A  B     C     D
i1  1  4  11.0  14.0
i2  2  5  12.0  15.0
i3  3  6  13.0  16.0
i4  4  7   NaN   NaN